protracker-back/app/controllers/activities_controller.rb

SELECT "activities".* FROM "activities" WHERE (parameters != '{}')
---
    def get_activities
      activities = PublicActivity::Activity.all.where("parameters != '{}'").map do |activity|