protracker-back/app/controllers/application_controller.rb

    def update_last_seen_at
        current_user.update_attribute(:last_seen_at, Time.current)
---
UPDATE "users" SET "last_seen_at" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["last_seen_at", "2023-04-19 05:26:55.917743"], ["updated_at", "2023-04-19 05:26:55.918593"], ["id", 1]]