protracker-back/app/controllers/application_controller.rb

    def current_user
        user_now ||= User.find_by(id: session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def update_last_seen_at
      if current_user.last_seen_at.nil? || current_user.last_seen_at < 2.minutes.ago
        current_user.update(online_status: 'online', last_seen_at: Time.current)
---
UPDATE "users" SET "online_status" = $1, "last_seen_at" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["online_status", "online"], ["last_seen_at", "2023-04-19 19:05:34.941558"], ["updated_at", "2023-04-19 19:05:34.967596"], ["id", 1]]

    def set_user_offline
      current_user.update(online_status: 'offline', last_seen_at: Time.current)
---
UPDATE "users" SET "online_status" = $1, "last_seen_at" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["online_status", "offline"], ["last_seen_at", "2023-04-20 11:20:11.426180"], ["updated_at", "2023-04-20 11:20:11.440643"], ["id", 1]]

    def create_notification(actor, receiver, message, type)
        new_notification_params = {
          actor_id: actor.id,
          receiver_id: receiver.id,
          message: message,
          notification_type: type
        }

        Notification.create!(new_notification_params)
---
INSERT INTO "notifications" ("actor_id", "receiver_id", "message", "notification_type", "read", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def create_user_activity(entity, key, username, task, owner)
        entity.create_activity(
          key: key,
          parameters: {
            user: "#{username}",
            task: task,
            created_at: "at #{Time.now.strftime('%H:%M')}"
          },
          owner: owner
        )
---
INSERT INTO "activities" ("trackable_type", "trackable_id", "owner_type", "owner_id", "key", "parameters", "recipient_type", "recipient_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

    def unlock_achievement(name, recipient)
        achievement = Achievement.where(name: name).first
        recipient.user_achievements.create!(achievement: achievement)
---
SELECT "achievements".* FROM "achievements" WHERE "achievements"."name" = $1 ORDER BY "achievements"."id" ASC LIMIT $2  [["name", "Prolific Creator"], ["LIMIT", 1]]
INSERT INTO "user_achievements" ("user_id", "achievement_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 11], ["achievement_id", 3], ["created_at", "2023-04-21 08:27:45.504671"], ["updated_at", "2023-04-21 08:27:45.504671"]]