protracker-back/app/controllers/cohorts_controller.rb

INSERT INTO "cohorts" ("name", "start_date", "end_date", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
INSERT INTO "cohort_students" ("cohort_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["cohort_id", 1], ["user_id", 7], ["created_at", "2023-04-19 06:57:16.169834"], ["updated_at", "2023-04-19 06:57:16.169834"]]
---
    def create
        new_cohort = current_user.owned_cohorts.build(cohort_params)

        authorize new_cohort

        if !new_cohort.save
            render json: { errors: new_cohort.errors.full_messages }, status: :unprocessable_entity
            return
        end

        new_cohort.cohort_students.create(user: current_user)

SELECT "cohorts".* FROM "cohorts" WHERE "cohorts"."user_id" = $1  [["user_id", 1]]
SELECT "users".* FROM "users" INNER JOIN "cohort_students" ON "users"."id" = "cohort_students"."user_id" WHERE "cohort_students"."cohort_id" = $1  [["cohort_id", 2]]
---
    def cohort_admin
        current_cohort = Cohort.find_by(id: params[:cohort_id].to_i)
        if current_cohort
            cohort_admin = User.find_by(id: current_cohort.user_id)