protracker-back/app/controllers/cohort_students_controller.rb

    def create
        cohort = Cohort.find_by(id: params[:cohort_id])

        authorize cohort, :owner?

        student = User.find_by(email: params[:email])

        if !student
          render json: { message: "Student not found" } , status: :not_found
          return
        end

        student_exists_in_the_cohort = cohort.cohort_members.exists?(user_id: student.id)

        if student_exists_in_the_cohort
          render json: { message: "Student exists in the cohort" } , status: :unprocessable_entity
          return
        end

        @cohort_student = CohortStudent.new(user_id: student.id, cohort_id: params[:cohort_id])

        authorize @cohort_student

        if !@cohort_student.save
---
SELECT "cohorts".* FROM "cohorts" WHERE "cohorts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "sarah.smith@example.com"], ["LIMIT", 1]]
SELECT 1 AS one FROM "users" WHERE "users"."email" = $1 AND "users"."id" != $2 LIMIT $3  [["email", "moringa@gmail.com"], ["id", 7], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "cohort_students" ("cohort_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["cohort_id", 1], ["user_id", 2], ["created_at", "2023-04-19 08:55:15.327648"], ["updated_at", "2023-04-19 08:55:15.327648"]]

          notification_type: "Added to cohort"
        }

      new_notification  = Notification.create(new_notification_params)
---
INSERT INTO "notifications" ("actor_id", "receiver_id", "message", "notification_type", "read", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"