protracker-back/app/controllers/comments_controller.rb

    def show_thread
        parent_comment = Comment.find_by(id: params[:comment_id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def all_comments

        project = Project.find_by(id: params[:project_id])
        comments = project.comments.all
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."project_id" = $1  [["project_id", 1]]