protracker-back/app/controllers/notifications_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "notifications".* FROM "notifications" WHERE "notifications"."receiver_id" = $1  [["receiver_id", 1]]
---
    def get_notifications
        current_user = User.find(11)
        notifications = Notification.where(receiver_id: current_user.id)

SELECT "notifications".* FROM "notifications" WHERE "notifications"."receiver_id" = $1 AND "notifications"."read" = $2  [["receiver_id", 1], ["read", false]]
---
    def get_unread_notifications
        notifications = Notification.where(receiver_id: current_user.id, read: false)

SELECT "notifications".* FROM "notifications" WHERE "notifications"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "notifications" SET "read" = $1, "updated_at" = $2 WHERE "notifications"."id" = $3  [["read", true], ["updated_at", "2023-04-19 06:25:13.645453"], ["id", 1]]
---
    def mark_as_read
        notification = Notification.find_by(id: params[:notif_id])
        notification.read = true
        notification.save