protracker-back/app/controllers/project_members_controller.rb

    def add_member
        student = User.find_by(email: params[:email])

        if !student
            render json: { message: 'Student not found' }, status: :not_found
            return
        end

        cohort = current_user.enrolled_cohorts.find_by(id: params[:cohort_id])

        if !cohort
            render json: { message: 'Cohort not found' }, status: :not_found
            return
        end

        cohort_members = cohort.enrolled_members

        student_exists_in_cohort = cohort_members.exists?(student.id)

        if !student_exists_in_cohort
           render json: { message: 'Student does not exist in cohort' }, status: :not_found
           return
        end

        current_project = current_user.projects.find_by(id: params[:project_id].to_i)

        member = current_project.project_members.find_by(user_id: student.id)


        if !member
            current_project.project_members.create(user: student)

            current_project.create_activity(key: 'projectmember.create',parameters:{
                user: "#{current_user.username}",
                task: "added #{student.username} to a project titled '#{current_project.project_name}'",
                created_at: "at #{Time.now.strftime('%H:%M')}"
            }, owner: current_user)
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "sarah.smith@example.com"], ["LIMIT", 1]]
SELECT 1 AS one FROM "users" WHERE "users"."email" = $1 AND "users"."id" != $2 LIMIT $3  [["email", "jimmymaina@gmail.com"], ["id", 11], ["LIMIT", 1]]
SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = $1 AND "projects"."id" = $2 LIMIT $3  [["user_id", 11], ["id", 1], ["LIMIT", 1]]
SELECT "project_members".* FROM "project_members" WHERE "project_members"."project_id" = $1 AND "project_members"."user_id" = $2 LIMIT $3  [["project_id", 1], ["user_id", 2], ["LIMIT", 1]]
INSERT INTO "project_members" ("user_id", "project_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 2], ["project_id", 1], ["created_at", "2023-04-21 09:42:03.866897"], ["updated_at", "2023-04-21 09:42:03.866897"]]
INSERT INTO "activities" ("trackable_type", "trackable_id", "owner_type", "owner_id", "key", "parameters", "recipient_type", "recipient_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

                notification_type: "Added to project"
            }

            new_notification  = Notification.create(new_notification_params)
---
INSERT INTO "notifications" ("actor_id", "receiver_id", "message", "notification_type", "read", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"


            if(enrolled_projects == 10)

                user_achievement = Achievement.where(name: "Team Player").first
                student.user_achievements.create!(achievement: user_achievement)
---
SELECT "achievements".* FROM "achievements" WHERE "achievements"."name" = $1 ORDER BY "achievements"."id" ASC LIMIT $2  [["name", "Team Player"], ["LIMIT", 1]]
INSERT INTO "user_achievements" ("user_id", "achievement_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 2], ["achievement_id", 4], ["created_at", "2023-04-21 09:42:04.103831"], ["updated_at", "2023-04-21 09:42:04.103831"]]