protracker-back/app/controllers/projects_controller.rb

    def create
        new_project = current_user.projects.build(project_params)
        current_cohort = current_user.enrolled_cohorts.find_by(id: params[:cohort_id])

        if !current_cohort
            render json: { message: 'Cohort not found' }, status: :not_found
            return
        end

        new_project = current_user.projects.build(project_params)
        new_project.cohort = current_cohort

        if !new_project.save
            render json: { errors: new_project.errors.full_messages } , status: :unprocessable_entity
            return
        end

        tags = params[:tags]

        if tags
            new_project.tags.build(tags.map { |tag| { name: tag } })
        end

        new_project.project_members.build(user: current_user)

        new_project.save

        user_projects_count = current_user.projects.count.to_i
---
INSERT INTO "projects" ("project_name", "project_description", "github_link", "category", "user_id", "cohort_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
SELECT "cohorts".* FROM "cohorts" INNER JOIN "cohort_students" ON "cohorts"."id" = "cohort_students"."cohort_id" WHERE "cohort_students"."user_id" = $1 AND "cohorts"."id" = $2 LIMIT $3  [["user_id", 11], ["id", 1], ["LIMIT", 1]]
INSERT INTO "project_members" ("user_id", "project_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 11], ["project_id", 1], ["created_at", "2023-04-21 08:18:22.393721"], ["updated_at", "2023-04-21 08:18:22.393721"]]
INSERT INTO "tags" ("name", "project_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "java"], ["project_id", 1], ["created_at", "2023-04-21 08:18:22.398727"], ["updated_at", "2023-04-21 08:18:22.398727"]]
SELECT COUNT(*) FROM "projects" WHERE "projects"."user_id" = $1  [["user_id", 11]]

        task = "created a project titled '#{new_project.project_name}'"

        create_user_activity(new_project, "project.create", current_user.username, new_project.project_name, task, current_user)
---
INSERT INTO "activities" ("trackable_type", "trackable_id", "owner_type", "owner_id", "key", "parameters", "recipient_type", "recipient_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

    def current_user_projects
        projects = current_user.projects.all

        if projects.empty?
---
SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = $1  [["user_id", 11]]
SELECT "projects".* FROM "projects" INNER JOIN "project_members" ON "projects"."id" = "project_members"."project_id" WHERE "project_members"."user_id" = $1  [["user_id", 11]]
SELECT 1 AS one FROM "projects" WHERE "projects"."user_id" = $1 LIMIT $2  [["user_id", 11], ["LIMIT", 1]]

    def my_assigned_projects
        assigned_projects = current_user.enrolled_projects

        if assigned_projects.empty?
---
SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = $1  [["user_id", 7]]