protracker-back/app/controllers/project_members_controller.rb

    def add_member
        student = User.find_by(id: params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]