protracker-back/app/controllers/session_controller.rb

    def login
        user = User.find_by(email: params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "jeffmaina@gmail.com"], ["LIMIT", 1]]