protracker-back/app/controllers/users_controller.rb

    def create
        username = params[:first_name] + ' ' + params[:last_name];
        user = User.new(user_params)
        user.username = username
        user.password = params[:password]
        user.password_reset_token= SecureRandom.urlsafe_base64
        if user.save
---
INSERT INTO "users" ("username", "email", "password_digest", "password_reset_token", "admin", "bio", "github_link", "avatar_url", "online_status", "last_seen_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"

    def make_admin
      student = User.find_by(email: params[:email])

      if !student.present?
        render json: { message: 'Student not found' }, status: :not_found
        return
      end

      if current_user.admin?
        if student
          student.admin = true
          student.save

          new_notification_params = {
            actor_id: current_user.id,
            receiver_id: student.id,
            message: "#{current_user.username} gave you administrative rights.",
            notification_type: "Granted administrative rights."
        }

        new_notification  = Notification.create(new_notification_params)
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "jeffgichuki@gmail.com"], ["LIMIT", 1]]
SELECT 1 AS one FROM "users" WHERE "users"."email" = $1 AND "users"."id" != $2 LIMIT $3  [["email", "jeffmaina@gmail.com"], ["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "admin" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["admin", true], ["updated_at", "2023-04-19 06:09:41.747759"], ["id", 1]]
INSERT INTO "notifications" ("actor_id", "receiver_id", "message", "notification_type", "read", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def remove_admin
      student = User.find_by(email: params[:email])
      if current_user.admin?
        if student
          student.admin = false
          student.save
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "jeffmaina@gmail.com"], ["LIMIT", 1]]
UPDATE "users" SET "bio" = $1, "github_link" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["bio", "Sarah's bio"], ["github_link", "https://sarah.git"], ["updated_at", "2023-04-19 06:03:33.305651"], ["id", 2]]

    def update
      if current_user.update(user_params)
        current_user.create_activity(key: 'user.update',parameters:{
          user: "#{current_user.username}",
          task: "updated their profile details ",
          created_at: "at #{Time.now.strftime('%H:%M')}"
      }, owner: current_user)
---
UPDATE "users" SET "bio" = $1, "github_link" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["bio", "Sarah's bio"], ["github_link", "https://sarah.git"], ["updated_at", "2023-04-19 06:03:33.305651"], ["id", 2]]
INSERT INTO "activities" ("trackable_type", "trackable_id", "owner_type", "owner_id", "key", "parameters", "recipient_type", "recipient_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"