protracker-back/app/controllers/users_controller.rb

    def make_admin
      student = User.find_by(id: params[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]

    def remove_admin
      student = User.find_by(id: params[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]